mmazat/MeshCore/variants/esp32s3_n16r8_sx1262/ESP32S3N16R8SX1262Board.cpp
#include "ESP32S3N16R8SX1262Board.h"

#include <Arduino.h>
#include <FS.h>
#include <SPI.h>
#include <SD_MMC.h>
#include <esp_camera.h>

namespace {

uint32_t crc32_update(uint32_t crc, const uint8_t* data, size_t len) {
  crc = ~crc;
  for (size_t i = 0; i < len; ++i) {
    crc ^= data[i];
    for (int bit = 0; bit < 8; ++bit) {
      crc = (crc >> 1) ^ (0xEDB88320u & (-(int32_t)(crc & 1u)));
    }
  }
  return ~crc;
}



bool init_camera() {
  camera_config_t config = {};
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = CAM_PIN_Y2;
  config.pin_d1 = CAM_PIN_Y3;
  config.pin_d2 = CAM_PIN_Y4;
  config.pin_d3 = CAM_PIN_Y5;
  config.pin_d4 = CAM_PIN_Y6;
  config.pin_d5 = CAM_PIN_Y7;
  config.pin_d6 = CAM_PIN_Y8;
  config.pin_d7 = CAM_PIN_Y9;
  config.pin_xclk = CAM_PIN_XCLK;
  config.pin_pclk = CAM_PIN_PCLK;
  config.pin_vsync = CAM_PIN_VSYNC;
  config.pin_href = CAM_PIN_HREF;
  config.pin_sccb_sda = CAM_PIN_SIOD;
  config.pin_sccb_scl = CAM_PIN_SIOC;
  config.pin_pwdn = CAM_PIN_PWDN;
  config.pin_reset = CAM_PIN_RESET;
  config.xclk_freq_hz = CAM_XCLK_FREQ_HZ;
  config.pixel_format = PIXFORMAT_JPEG;
  // The OV2640 JPEG DSP must be initialised at UXGA (its native full
  // resolution) before being switched to a smaller capture size.
  // Initialising directly at VGA or smaller scrambles JPEG output because
  // the internal quantisation tables are not set up correctly.
  // This matches the Espressif CameraWebServer reference example.
  config.frame_size = FRAMESIZE_UXGA;
  config.jpeg_quality = CAM_JPEG_QUALITY;
  config.fb_count = 1;
  config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
  config.fb_location = CAMERA_FB_IN_PSRAM;

  if (psramFound()) {
    config.jpeg_quality = CAM_JPEG_QUALITY <= 10 ? CAM_JPEG_QUALITY : 10;
    // Single buffer + GRAB_WHEN_EMPTY is safest for single-shot capture:
    // no DMA can overwrite the buffer while we hold it via fb_get().
    config.fb_count = 1;
    config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
  } else {
    // Without PSRAM: drop to SVGA so the JPEG frame fits in DRAM.
    config.frame_size = FRAMESIZE_SVGA;
    config.fb_location = CAMERA_FB_IN_DRAM;
  }

  // Deinit first to release any previously allocated GDMA channels or
  // peripheral state from a prior (possibly failed) init call.
  esp_camera_deinit();

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("camera init failed: 0x%x\n", err);
    // Deinit after failure so the partially-allocated GDMA channel is released.
    // Without this, esp_camera_init's own cleanup path logs:
    //   gdma_disconnect: no peripheral is connected to the channel
    // and leaves the GDMA controller in a dirty state.
    esp_camera_deinit();
    return false;
  }

  // Switch to desired capture resolution now that the JPEG DSP is initialised.
  sensor_t* sensor = esp_camera_sensor_get();
  if (sensor) {
    sensor->set_framesize(sensor, FRAMESIZE_VGA);
  }

  // Discard frames so AEC/AWB settles and the frame-size switch pipeline flushes.
  for (int i = 0; i < 5; i++) {
    camera_fb_t* warmup = esp_camera_fb_get();
    if (warmup) {
      esp_camera_fb_return(warmup);
    }
  }

  Serial.println("camera init OK (UXGA DSP init -> VGA capture)");
  return true;
}

bool init_sd() {
#if defined(BOARD_USE_SD_MMC)
  if (!SD_MMC.setPins(SDMMC_CLK_PIN, SDMMC_CMD_PIN, SDMMC_D0_PIN)) {
    Serial.println("sd pin assign failed");
    return false;
  }

  // Always end first so the SDMMC host is in a clean state before begin().
  // Skipping this causes ESP_ERR_TIMEOUT (0x107) on any retry because the
  // host peripheral is left partially initialised from the previous attempt.
  SD_MMC.end();

  // First attempt at default speed.
  bool mounted = SD_MMC.begin("/sdcard", true /* 1-bit mode */);
  if (!mounted) {
    // Some SD cards reject the default ~40 MHz SDMMC clock. Retry once at
    // 20 MHz (SDMMC_FREQ_HIGHSPEED / 2) before giving up.
    SD_MMC.end();
    delay(50);
    mounted = SD_MMC.begin("/sdcard", true /* 1-bit mode */, false /* format_if_failed */, SDMMC_FREQ_DEFAULT);
    if (!mounted) {
      Serial.println("sd init failed");
      return false;
    }
    Serial.println("sd init OK at reduced speed");
  }

  uint8_t card_type = SD_MMC.cardType();
  if (card_type == CARD_NONE) {
    Serial.println("sd card missing");
    return false;
  }

  return true;
#else
  return false;
#endif
}

} // namespace

bool ESP32S3N16R8SX1262Board::mountSD() {
  if (sd_mounted) {
    return true;
  }

  // Ensure any previous partial init is cleaned up before retrying.
  SD_MMC.end();
  sd_online = init_sd();
  sd_mounted = sd_online;
  return sd_online;
}


// SD card is never unmounted; keep initialized for the entire runtime.
void ESP32S3N16R8SX1262Board::unmountSD() {
  // No-op
}

void ESP32S3N16R8SX1262Board::begin() {
  ESP32Board::begin();
  // Initialize SD before camera: esp_camera_init() failure leaves the shared
  // ESP32-S3 GDMA controller in a dirty state (gdma_disconnect on an
  // unconnected channel). SDMMC also uses GDMA, so if camera runs first and
  // fails, SD init gets ESP_ERR_TIMEOUT (0x107) because it can't claim a DMA
  // channel. Mounting SD first avoids this race entirely.
  sd_online = mountSD();
  camera_online = init_camera();
  // SD card remains mounted for the entire runtime
}

bool ESP32S3N16R8SX1262Board::captureToSD(char* path_buffer, size_t path_buffer_size,
                                         size_t* bytes_written,
                                         uint16_t* out_width, uint16_t* out_height) {
  if (bytes_written != nullptr) {
    *bytes_written = 0;
  }
  if (out_width != nullptr) {
    *out_width = 0;
  }
  if (out_height != nullptr) {
    *out_height = 0;
  }

  if (!camera_online || path_buffer == nullptr || path_buffer_size == 0) {
    return false;
  }

  if (!mountSD()) {
    return false;
  }

  // Discard any frame that was buffered while the camera was idle so we always
  // capture a fresh frame with correct exposure and white balance.
  {
    camera_fb_t* stale = esp_camera_fb_get();
    if (stale) {
      esp_camera_fb_return(stale);
    }
  }

  camera_fb_t* frame = esp_camera_fb_get();
  if (frame == nullptr) {
    Serial.println("camera capture failed");
    unmountSD();
    return false;
  }

  // Verify the sensor returned a JPEG frame. If it returns a raw format
  // (YUV/RGB) and we write it as .jpg the file will appear scrambled.
  if (frame->format != PIXFORMAT_JPEG) {
    Serial.printf("capture: unexpected pixel format %d (expected JPEG)\n", (int)frame->format);
    esp_camera_fb_return(frame);
    path_buffer[0] = 0;
    unmountSD();
    return false;
  }

  // Check JPEG integrity markers before writing to SD.
  // SOI = FF D8 at start, EOI = FF D9 at end.
  bool has_soi = (frame->len >= 2 && frame->buf[0] == 0xFF && frame->buf[1] == 0xD8);
  bool has_eoi = (frame->len >= 2 && frame->buf[frame->len - 2] == 0xFF && frame->buf[frame->len - 1] == 0xD9);
  Serial.printf("capture: %ux%u %u bytes SOI=%d EOI=%d\n",
                frame->width, frame->height,
                static_cast<unsigned>(frame->len), has_soi, has_eoi);
  if (!has_soi) {
    Serial.println("capture: JPEG missing SOI marker — frame is corrupt from camera");
    esp_camera_fb_return(frame);
    path_buffer[0] = 0;
    unmountSD();
    return false;
  }

  unsigned long capture_id = millis();
  snprintf(path_buffer, path_buffer_size, "/capture_%010lu.jpg", capture_id);

  File image = SD_MMC.open(path_buffer, FILE_WRITE);
  if (!image) {
    Serial.printf("capture open failed: %s\n", path_buffer);
    esp_camera_fb_return(frame);
    path_buffer[0] = 0;
    unmountSD();
    return false;
  }

  if (out_width != nullptr) {
    *out_width = frame->width;
  }
  if (out_height != nullptr) {
    *out_height = frame->height;
  }

  // Save frame metadata before fb_return — accessing frame-> after return
  // is use-after-free because DMA may reclaim the buffer immediately.
  const size_t frame_len = frame->len;

  size_t written = image.write(frame->buf, frame_len);
  image.flush();
  image.close();
  esp_camera_fb_return(frame);
  frame = nullptr;  // prevent accidental reuse

  if (bytes_written != nullptr) {
    *bytes_written = written;
  }

  if (written != frame_len) {
    Serial.printf("capture write failed: %s (%u/%u)\n", path_buffer,
                  static_cast<unsigned>(written), static_cast<unsigned>(frame_len));
    SD_MMC.remove(path_buffer);
    path_buffer[0] = 0;
    unmountSD();
    return false;
  }

  // Read back and verify the file matches what we wrote (catch SD corruption).
  File verify = SD_MMC.open(path_buffer, FILE_READ);
  if (verify) {
    size_t file_size = verify.size();
    bool size_ok = (file_size == frame_len);
    // Check first 2 bytes are JPEG SOI
    uint8_t hdr[2] = {0, 0};
    verify.read(hdr, 2);
    bool file_soi = (hdr[0] == 0xFF && hdr[1] == 0xD8);
    verify.close();
    if (!size_ok || !file_soi) {
      Serial.printf("capture verify FAILED: %s (file=%u expected=%u SOI=%d)\n",
                    path_buffer, static_cast<unsigned>(file_size),
                    static_cast<unsigned>(frame_len), file_soi);
      SD_MMC.remove(path_buffer);
      path_buffer[0] = 0;
      unmountSD();
      return false;
    }
  }

  Serial.printf("capture saved: %s (%u bytes)\n", path_buffer, static_cast<unsigned>(written));
  return true;
}

bool ESP32S3N16R8SX1262Board::getSDFileSize(const char* path, size_t* file_size) {
  if (file_size != nullptr) {
    *file_size = 0;
  }

  if (path == nullptr || file_size == nullptr || !mountSD()) {
    return false;
  }

  File file = SD_MMC.open(path, FILE_READ);
  if (!file || file.isDirectory()) {
    return false;
  }

  *file_size = static_cast<size_t>(file.size());
  file.close();
  return true;
}

bool ESP32S3N16R8SX1262Board::computeSDFileCRC32(const char* path, uint32_t* crc32_out) {
  if (crc32_out != nullptr) {
    *crc32_out = 0;
  }

  if (path == nullptr || crc32_out == nullptr || !mountSD()) {
    return false;
  }

  File file = SD_MMC.open(path, FILE_READ);
  if (!file || file.isDirectory()) {
    return false;
  }

  uint8_t buffer[256];
  while (true) {
    size_t bytes_read = file.read(buffer, sizeof(buffer));
    if (bytes_read == 0) {
      break;
    }
    *crc32_out = crc32_update(*crc32_out, buffer, bytes_read);
    if (bytes_read < sizeof(buffer)) {
      break;
    }
  }

  file.close();
  return true;
}

bool ESP32S3N16R8SX1262Board::readSDFileChunk(const char* path, size_t offset, uint8_t* buffer,
                                              size_t buffer_size, size_t* bytes_read) {
  if (bytes_read != nullptr) {
    *bytes_read = 0;
  }

  if (path == nullptr || buffer == nullptr || bytes_read == nullptr || buffer_size == 0 || !mountSD()) {
    return false;
  }

  File file = SD_MMC.open(path, FILE_READ);
  if (!file || file.isDirectory()) {
    return false;
  }

  bool seek_ok = file.seek(offset);
  if (!seek_ok) {
    file.close();
    return false;
  }

  *bytes_read = file.read(buffer, buffer_size);
  file.close();
  return true;
}